obsfeil/F28379D_Robot_CCS_12.7.1/UART_Segbot..c
    //2A and 2B - Motors
    EPwm2Regs.TBCTL.bit.CTRMODE = 0; //count up mode
    EPwm2Regs.TBCTL.bit.FREE_SOFT = 2; //free run
    EPwm2Regs.TBCTL.bit.PHSEN = 0; //disable phase loading
    EPwm2Regs.TBCTL.bit.CLKDIV = 0; //clock divide = 1
    EPwm2Regs.TBCTR = 0; //start the timers at 0
    EPwm2Regs.TBPRD = 2500; //set period to 50 microseconds (20 kHz)
    // (1/50MHz)*TBPRD = 50 us
    EPwm2Regs.CMPA.bit.CMPA = 0; //start duty cycle at 0%
    EPwm2Regs.CMPB.bit.CMPB = 0; //start duty cycle at 0%
    // duty cycle = CMPA/TBPRD
    EPwm2Regs.AQCTLA.bit.CAU = 1; //clear signal when TBCTR = CMPA
    EPwm2Regs.AQCTLB.bit.CBU = 1; //clear signal when TBCTR = CMPB
    EPwm2Regs.AQCTLA.bit.ZRO = 2; //set to high at 0
    EPwm2Regs.AQCTLB.bit.ZRO = 2; //set to high at 0
    EPwm2Regs.TBPHS.bit.TBPHS = 0; //set phase to 0
    GPIO_SetupPinMux(2, GPIO_MUX_CPU1, 1); //ePWM 2A
    GPIO_SetupPinMux(3, GPIO_MUX_CPU1, 1); //ePWM 2B

    init_eQEPs(); //call eQEP setup function

    // Enable CPU int1 which is connected to CPU-Timer 0, CPU int13
    // which is connected to CPU-Timer 1, and CPU int 14, which is connected
    // to CPU-Timer 2:  int 12 is for the SWI.  
    IER |= M_INT1;
    IER |= M_INT8;  // SCIC SCID
    IER |= M_INT9;  // SCIA
    IER |= M_INT12;
    IER |= M_INT13;
    IER |= M_INT14;
    IER |= M_INT6; //SPI

    // Enable TINT0 in the PIE: Group 1 interrupt 7
    PieCtrlRegs.PIEIER1.bit.INTx7 = 1;
    // Enable SWI in the PIE: Group 12 interrupt 9
    PieCtrlRegs.PIEIER12.bit.INTx9 = 1;
    //Enable SPI
    PieCtrlRegs.PIEIER6.bit.INTx3 = 1;
    //Enable ADCA1
    PieCtrlRegs.PIEIER1.bit.INTx1 = 1;

    // Enable global Interrupts and higher priority real-time debug events
    EINT;  // Enable Global interrupt INTM
    ERTM;  // Enable Global realtime interrupt DBGM


    // IDLE loop. Just sit and loop forever (optional):
    while(1)
    {
        if (UARTPrint == 1 ) {
//            serial_printf(&SerialC,"Num Timer2:%ld Num SerialRX: %ld\r\n",CpuTimer2.InterruptCount,numRXA); //prints to BT app
            serial_printf(&SerialC,"FwdBackOffset: %.2f TurnRate: %.2f\r\n",FwdBackOffset, turnrate); //prints to BT app
            UARTPrint = 0;
        }
    }
}


// SWI_isr,  Using this interrupt as a Software started interrupt
__interrupt void SWI_isr(void) {

    // These three lines of code allow SWI_isr, to be interrupted by other interrupt functions
    // making it lower priority than all other Hardware interrupts.
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;
    asm("       NOP");                    // Wait one cycle
    EINT;                                 // Clear INTM to enable interrupts



    // Insert SWI ISR Code here.......
    //solve for filtered velocity in rads/s
    LeftVel = .6*LeftVel_1 + 100*(LeftWheel-LeftWheel_1);
    RightVel = .6*RightVel_1 + 100*(RightWheel-RightWheel_1);

    //Turning
    WheelDif = LeftWheel - RightWheel;
    velWheelDif = .33*velWheelDif_1 + .67*(WheelDif-WheelDif_1)/.004;
    eDif = turnref - WheelDif;
    //calculate iDif without integral windup
    if(fabs(turn)>3){
        iDif = iDif_1;
    }else{
        iDif = iDif_1 + .004*(eDif+eDif_1)/2;
    }

    //Calculate Balance and Turn COntrols
    ubal = -K1*tilt_value -K2*gyro_value - K3*(LeftVel+RightVel)/2.0;
    turn = Kp*eDif + Ki*iDif - Kd*velWheelDif;
    //saturate turn so balance control dominates (controllefford between +-10)
    if(turn>4){
        turn = 4;
    }else if(turn<-4){
        turn = -4;
    }

    turnref = turnref_1 + (turnrate + turnrate_1)*.004/2.0;

    //Calculate controleffort for each motor
    uRight = ubal/2.0 - turn + FwdBackOffset;
    uLeft = ubal/2.0 + turn + FwdBackOffset;

    //Send ControlEffort to PWM Motor Command
    setEPWM2A(uRight);
    setEPWM2B(-uLeft);

    //Save Past States
    LeftVel_1 = LeftVel;
    RightVel_1 = RightVel;
    LeftWheel_1 = LeftWheel;
    RightWheel_1 = RightWheel;
    eDif_1 = eDif;
    iDif_1 = iDif;
    turnrate_1 = turnrate;
    turnref_1 = turnref;

    numSWIcalls++;
    
    DINT;

}

// cpu_timer0_isr - CPU Timer0 ISR
__interrupt void cpu_timer0_isr(void)
{
    CpuTimer0.InterruptCount++;

    numTimer0calls++;

//    if ((numTimer0calls % 200) == 0) {
//        UARTPrint = 1;
//    }

    // Blink LaunchPad Red LED
//    GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;

    // Acknowledge this interrupt to receive more interrupts from group 1
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

// cpu_timer1_isr - CPU Timer1 ISR
__interrupt void cpu_timer1_isr(void)
{

    CpuTimer1.InterruptCount++;
}

// cpu_timer2_isr CPU Timer2 ISR
__interrupt void cpu_timer2_isr(void)
{


    // Blink LaunchPad Blue LED
//    GpioDataRegs.GPATOGGLE.bit.GPIO31 = 1;

    CpuTimer2.InterruptCount++;

}

// This function is called each time a char is recieved over UARTA.
void serialRXA(serial_t *s, char data) {
    numRXA ++;
//    if (data == 'q') {
//        turnrate = turnrate - 0.2;
//    } else if (data == 'r') {
//        turnrate = turnrate + 0.2;
//    } else if (data == '3') {
//        FwdBackOffset = FwdBackOffset - 0.2;
//    } else if (data == 's') {
//        FwdBackOffset = FwdBackOffset + 0.2;
//    } else {
//        turnrate = 0;
//        FwdBackOffset = 0;
//    }
}

char sendback[10];
char past[10];
void serialRXC(serial_t *s, char data) {
    sendback[0] = data;
    serial_send(&SerialA, sendback, 1); //every character that comes into BT will be echoed to Tera Term

    //save past states
    past[0] = past[1];
    past[1] = past[2];
    past[2] = past[3];
    past[3] = past[4];
    past[4] = past[5];
    past[5] = past[6];
    past[6] = past[7];
    past[7] = past[8];
    past[8] = past[9];
    past[9] = data;

    if((past[4] == '6')&&(past[9] == '7')){
        //up arrow pressed, speed up '!B516!B507'
        //saturate fwdbackoffset so segbot doesn't fall over
        if(FwdBackOffset <= -2){
            FwdBackOffset = -2;
        }else{
            FwdBackOffset = FwdBackOffset - 0.2;
        }
    }else if((past[4] == '5')&&(past[9] == '6')){
        //down arrow pressed, slow down '!B615!B606'
        //saturate fwdbackoffset so segbot doesn't fall over
        if(FwdBackOffset >= 2){
            FwdBackOffset = 2;
        }else{
            FwdBackOffset = FwdBackOffset + 0.2;
        }
    }else if((past[4] == '4')&&(past[9] == '5')){
        //turn left '!B714!B705'
        if(turnrate > 0){
            //stop turning opposite direction
            turnrate = 0;
        }else{
            turnrate = turnrate - 0.2;
        }
    }else if((past[4] == '3')&&(past[9] == '4')){
        //turn right '!B813!B804'
        if(turnrate < 0){
            //stop turning opposite direction
            turnrate = 0;
        }else{
            turnrate = turnrate + 0.2;
        }
    }else if((past[4] == '9')&&(past[9] == ':')){
        //balance still if 2 is pressed
        turnrate = 0;
        FwdBackOffset = 0;
    }
}


__interrupt void ADCA_ISR(void){
        adca0result = AdcaResultRegs.ADCRESULT0; //read ADC values
        adca1result = AdcaResultRegs.ADCRESULT1;

